app/controllers/term_paper_controller.rb

  def list_groups
    begin
      @faculties = [@faculty = Faculty.find(params[:id])]
    rescue ActiveRecord::RecordNotFound
      @faculties = Faculty.find(:all)
    end

    @groups = Hash.new
    @faculties.each do |f|
      @groups[f.id] = Group.find(:all, :conditions => ["faculty_id = ? AND year = ?", f.id, session[:year]], :order => "name ASC").inject(Hash.new{Array.new}) do |groups, g|
---
SELECT * FROM "faculties" WHERE ("faculties"."id" = 10)
SELECT * FROM "faculties"
SELECT * FROM "groups" WHERE (faculty_id = 1 AND year = 2008) ORDER BY name ASC

  def list_subjects
    @group = Group.find(params[:id])
    @subjects = @group.group_subjects
---
SELECT * FROM "groups" WHERE ("groups"."id" = 25)
SELECT * FROM "group_subjects" WHERE ("group_subjects".group_id = 25)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 174)

  def list_students
    @group_subject = GroupSubject.find(params[:id])
---
SELECT * FROM "group_subjects" WHERE ("group_subjects"."id" = 1)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 168)

  def create
    @group_subject = GroupSubject.find(params[:group_subject_id])
    @student = Student.find(params[:student_id])
    navigation_objects(@group_subject)
    @term_paper = TermPaper.new
    @term_paper.group_subject_id = @group_subject.id
---
SELECT * FROM "group_subjects" WHERE ("group_subjects"."id" = 17)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 13)
SELECT * FROM "students" WHERE ("students"."id" = 334)
SELECT * FROM "groups" WHERE ("groups"."id" = 2)

  def create_commit
    @term_paper = TermPaper.new(params[:term_paper])
    @term_paper.save
    unless @term_paper.errors.empty?
      @group_subject = @term_paper.group_subject
---
INSERT INTO "term_papers" ("student_id", "created_at", "updated_at", "group_subject_id", "mark", "file", "teacher_name") VALUES(328, '2009-07-07 08:49:44.328428', '2009-07-07 08:49:44.328428', 32, 3, E'main.c', E'ddd') RETURNING "id"
SELECT * FROM "groups"

  def download
    @term_paper = TermPaper.find(params[:id])
---
SELECT * FROM "term_papers" WHERE ("term_papers"."id" = 9)

  def history
    @group_subject = GroupSubject.find(params[:group_subject_id])
    @student = Student.find(params[:student_id])
    navigation_objects(@group_subject)
    @term_papers = TermPaper.find(:all, :conditions => ["group_subject_id = ? AND student_id = ?", @group_subject.id, @student.id], :order => "updated_at DESC")
---
SELECT * FROM "group_subjects" WHERE ("group_subjects"."id" = 8)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 6)
SELECT * FROM "students" WHERE ("students"."id" = 328)
SELECT * FROM "term_papers" WHERE (group_subject_id = 8 AND student_id = 337) ORDER BY updated_at DESC